#+STARTUP: hidestars
#+TITLE:Orc Battle!

Orc Battle is a game where you are a knight surrounded by 12
monsters, and you have to fight and defeat all of them using a
repertoire of sword-fighting abilities.

First! We need to define some state the game will use:

* COMMENT Monster building and management
The promised =init-monsters= function we have in the [[The main functions][main function]] is
going to be used to generate a slew of baddies for our player to get
ravaged by.

Here is the implementation from the book:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun init-monsters ()
    (setf *monsters*
          (map 'vector
               (lambda (x)
                 (funcall (nth (random (length *monster-builders*))
                               ,*monster-builders*)))
               (make-array *monster-num*))))
#+END_SRC

#+RESULTS:
: INIT-MONSTERS

This function uses a new first argument to =map=, the =vector=
symbol, which returns an array from the map, for example:

#+BEGIN_SRC lisp :exports both
  (map 'vector (lambda (x) x) "Snivy")
#+END_SRC

#+RESULTS:
: #(#\S #\n #\i #\v #\y)

It then uses =nth= to pick a random builder function from the
existing =*monster-builders*= list, and passes it to =funcall=,
which, when returned from =map=, will generate an array filled with
randomly generated monsters.

We then need a way to check if an individual monster is dead:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun monster-dead (m)
    (<= (monster-health m) 0))
#+END_SRC

#+RESULTS:
: MONSTER-DEAD

And then using this with the =every= aggregation function, we can
check if all the monsters are dead:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun monsters-dead ()
    (every #'monster-dead *monsters*))
#+END_SRC

#+RESULTS:
: MONSTERS-DEAD

Then, like for the player, we need a way to show the monsters:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defun show-monsters ()
    (fresh-line)
    (princ "Your foes:")
    (let ((x 0))
      (map 'list
           (lambda (m)
             (fresh-line)
             (princ "   ")
             (princ (incf x))
             (princ ". ")
             (if (monster-dead m)
                 (princ "**dead**")
                 (progn (princ "(Health=")
                        (princ (monster-health m))
                        (princ ") ")
                        (monster-show m))))
           ,*monsters*)))
#+END_SRC

#+RESULTS:
: SHOW-MONSTERS

This function adds a few more promises to our current list... One of
those is a =monster-show= function that will perform the rest of the
displaying for individual monsters...

The rest of it is a simple =princ= of the monster's health (Or dead
state). The number that references each monster is a simple call to
=incf= with a number starting from zero, so the number is incremented
and then returned. (Meaning the monsters are indexed from 1 for
selections)

=incf= accepts a single parameter, the amount to increment, but if
that is not present, it simply increments by 1. It is actually a
variant of =setf= made specifically to =setf= incremented numbers:
#+BEGIN_SRC lisp :exports both
  (let ((x 0))
    (incf x))
#+END_SRC

#+RESULTS:
: 1

* The generic monster!
Here is where we start actually doing some generic programming!

First of all, we will create a [[file:dataTypes.org::Structures][struct]] that will define what our
"generic" monster looks like:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defstruct monster (health (randval 10)))
#+END_SRC

#+RESULTS:
: MONSTER

As you can see here, we can actually define an initial value for the
slots in a structure... So when we call =make-monster=, we will
always get a monster with a random quantity of health:
#+BEGIN_SRC lisp :exports both
  (make-monster)
#+END_SRC

#+RESULTS:
: #S(MONSTER :HEALTH 7)

** Generic attacking
When we attack any monster, their health will go down, so we can
create a method with =defmethod= that will have the generic code for
all monsters:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-hit (m x)
    (decf (monster-health m) x)
    (if (monster-dead m)
        (progn (princ "You killed the ")
               (princ (type-of m))
               (princ "! "))
        (progn (princ "You hit the ")
               (princ (type-of m))
               (princ ", knocking off ")
               (princ x)
               (princ " health points! "))))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<BUILT-IN-CLASS T> #<BUILT-IN-CLASS T>)>

This method uses a new =type-of= function, that, handily, we don't
actually have to code, as it will return the type of its parameter as
a string. For example, if called with our generic =monster= structure,
we would get:
#+BEGIN_SRC lisp :exports both
  (type-of (make-monster))
#+END_SRC

#+RESULTS:
: MONSTER

We also use =decf=, which works to subtract an amount from a value and
=setf= it, which is the exact opposite of =incf=.

Now, for the other generic monster functions:

** Generic monster showing
With the neat =typeof=, we don't really need to be able to determine
the type of the structure we are looking at with specific
implementations that merely return their name, so we can simply do
the following:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-show (m)
    (princ "A fierce ")
    (princ (type-of m)))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<BUILT-IN-CLASS T>)>

** Generic monster attacking
Monster attacks are unique, with no resemblance to each other, so the
method with no qualifiers for monsters is just empty:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-attack (m))
#+END_SRC 

#+RESULTS:
: #<STANDARD-METHOD (#<BUILT-IN-CLASS T>)>

Now, we are ready to implement individual enemies!

** Orc showing
Despite the fact we can see that we are looking at an orc when we use
the existing =monster-show= method on orcs, we are going to write a
more specialized version of it to provide more information about the
orc. (Or more specifically, the club it is holding.)

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-show ((m orc))
    (princ "A wicked orc with a level ")
    (princ (orc-club-level m))
    (princ " club"))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS ORC>)>

That way, the player can see which orcs are the most dangerous at a
glance.

** Orc attacks
Orcs have different types of clubs, so, we need to account for that
in our orc implementation of =monster-attack=:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-attack ((m orc))
    (let ((x (randval (orc-club-level m))))
      (princ "An orc swings at you and knocks off ")
      (princ x)
      (princ " of your health points. ")
      (decf *player-health* x)))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS ORC>)>

In the implementation above, we take a random amount of health
between 1 and the level of the club and =princ= out a message
indicating such.

Whelp, that's one enemy implementation down!

** Show, the Hydra implementation
Hydras can have many heads, so we will want to take this into account
for the hydra-displaying method:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-show ((m hydra))
    (princ "A malicious hydra with ")
    (princ (monster-health m))
    (princ " heads."))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS HYDRA>)>

Now for the other unique implementations!

** Hydras act differently when hit
Since we are using the health of the hydra as the head-count, we want
to create a more specialized method for =monster-hit= that will
communicate this:

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-hit ((m hydra) x)
    (decf (monster-health m) x)
    (if (monster-dead m)
        (princ "The corpse of the fully decapitated and decapacitated hydra falls to the floor! ")
        (progn (princ "You lop off ")
               (princ x)
               (princ " of the hydra's heads! "))))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS HYDRA> #<BUILT-IN-CLASS T>)>

** Hydras can attack with multiple heads!
Hydra heads aren't terribly dangerous on their own, but they have a
lot of them, and can attack with half of them at the same time... And
they grow more!

Our =monster-attack= implementation for hydras will allow it to attack
for one point of damage per head, but only a random number of possible
heads will actually attack.

After each attack, it is also a good time to let the hydra grow
another head and regenerate a little.

#+BEGIN_SRC lisp :exports code :tangle yes 
  (defmethod monster-attack ((m hydra))
    (let ((x (randval (ash (monster-health m) -1))))
      (princ "A hydra attacks you with ")
      (princ x)
      (princ " of its heads! It also grows back one more head! ")
      (incf (monster-health m))
      (decf *player-health* x)))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS HYDRA>)>

And that's it for the hydra implementation!

** Slime mold showing
Slime molds have a special =sliminess= field, so our =monster-show=
implementation should show it, allowing our valiant hero to decide
where their priorities lie.

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-show ((m slime-mold))
    (princ "A slime mold with a sliminess of ")
    (princ (slime-mold-sliminess m)))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS SLIME-MOLD>)>

Simple enough. Now for the unique aspects of the monster!

** Slime mold attacks
Slime molds can attack, but they aren't really a threat damage-wise
since they can only deal one point of damage to you. No, rather they
are a threat because they decrease the player's agility and decrease
the amount of times that they can attack. This means that they are
easier taken-out by other enemies.

#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-attack ((m slime-mold))
    (let ((x (randval (slime-mold-sliminess m))))
      (princ "A slime mold wraps around your legs and decreases your agility by ")
      (princ x)
      (princ "! ")
      (decf *player-agility* x)
      (when (zerop (random 2))
        (princ "It also squirts in your face, taking away a health point! ")
        (decf *player-health*))))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS SLIME-MOLD>)>

And that's it for the Slime mold implementation!

** Brigand attacking style
Brigands have a slingshot and a whip they can use to damage the
player, injure them to decrease their strength, or trip them up
decreasing their agility.

Here is our brigand attacking code:
#+BEGIN_SRC lisp :exports code :tangle yes
  (defmethod monster-attack ((m brigand))
    (let ((x (max *player-health* *player-agility* *player-strength*)))
      (cond ((= x *player-health*)
             (princ "A brigand hits you with his slingshot, taking off 2 health points! ")
             (decf *player-health* 2))
            ((= x *player-agility*)
             (princ "A brigand catches your leg with his whip, taking off 2 agility points! ")
             (decf *player-agility* 2))
            ((= x *player-strength*)
             (princ "A brigand cuts your arm with his whip, taking off 2 strength points1 ")
             (decf *player-strength* 2)))))
#+END_SRC

#+RESULTS:
: #<STANDARD-METHOD (#<STRUCTURE-CLASS BRIGAND>)>

It just gets our highest stat, and then the brigand then chooses to
attack our highest stat, decreasing it by 2 points.

That's it!
